{
  "about": {
    "description": "Senior Frontend Engineer with 9+ years of experience building scalable, high-performance web applications using React, Next.js, Vue, and TypeScript.\n\nWorked across financial, automotive, travel, e-commerce, and education sectors, specializing in modern architectures (SSR, Microfrontends, BFF), design systems, and complex user experiences.\n\nCurrently based in Lisbon/Portugal."
  },
  "menu": {
    "home": "Home",
    "about": "About",
    "projects": "Projects",
    "experience": "Resume",
    "contact": "Contact"
  },
  "at": "at",
  "sections": {
    "experience": "Experience",
    "projects": "Projects",
    "techStack": "Tech Stack",
    "connect": "Connect",
    "contact": "Let's work together?"
  },
  "experience": {
    "yearsShort": "yrs"
  },
  "present": "Present",
  "projects": {
    "flowsign": {
      "name": "FlowSign",
      "description": "Digital signature platform for electronic document management and workflow automation."
    },
    "abconsindcon": {
      "name": "Abcon Sindcon Website",
      "description": "Construction industry union association website with member services and news."
    },
    "likeappro": {
      "name": "LikeAppro",
      "description": "Social approval and engagement platform for content validation and workflow management."
    },
    "previbayer": {
      "name": "Previ Bayer Brazil",
      "description": "Private pension fund management system for Bayer employees in Brazil."
    },
    "nespresso": {
      "name": "Nespresso Professional",
      "description": "Developed shipping module with carrier integration in cart and order return module in user admin dashboard."
    },
    "atvos": {
      "name": "Atvos Corporate Website",
      "description": "Corporate website for renewable energy and biofuels company."
    },
    "novonor": {
      "name": "Novonor News",
      "description": "News portal and corporate communications platform for Novonor group."
    },
    "vexty": {
      "name": "Vexty Investment Reports",
      "description": "Interactive investment reports and financial data visualization platform."
    }
  },
  "experiences": {
    "mercedesBenz": {
      "role": "Sr. Frontend Engineer",
      "company": "Mercedes-Benz.IO",
      "description": "Part of the team responsible for the Search & Results experience on the Mercedes-Benz website. Developed and maintained core features using TypeScript, Vue.js and SSR, improving performance and scalability."
    },
    "skrolCapital": {
      "role": "Sr. Frontend Engineer",
      "company": "SKROL Capital Inc.",
      "description": "Developed two full-stack AI-driven products: Investor Discovery Platform (Laravel, React, Python) and FlowSign AI Document Signing Platform (Laravel, React, Next.js). Led product architecture and end-to-end delivery."
    },
    "aubay": {
      "role": "Sr. Frontend Developer",
      "company": "Aubay Portugal",
      "description": "Contributed to new internal system modules for Millennium BCP Bank using React, Redux, and Node.js. Built components for enterprise design system in Agile environment."
    },
    "cvc": {
      "role": "Senior Frontend Developer",
      "company": "CVC CORP",
      "description": "Enhanced User Dashboard for millions of customers (flights, hotels, rentals). Key contributor in redesigning CVC Login System with microfrontend adoption. Built BFF endpoints with Node.js."
    },
    "netshoes": {
      "role": "Frontend Developer",
      "company": "Netshoes Group",
      "description": "Created marketing admin tools (Coupons, Clusters, Labels). Built promotions engine reducing processing time from 48h to 2h. Implemented promotion logic across homepage, cart, and checkout."
    },
    "rperformance": {
      "role": "Software Engineer",
      "company": "RPerformance Group",
      "description": "Led overhaul of e-learning platform for Santander Bank. Refactored architecture separating backend (Laravel) and frontend (React). Improved system scalability and performance."
    },
    "jota3w": {
      "role": "Software Engineer",
      "company": "Jota3w Comunicação Digital",
      "description": "Developed frontend solutions for enterprise clients. Built custom WordPress templates. Integrated Nespresso APIs and DocuSign. Developed shipping module for Nespresso. Led intranet development for Assaí supermarkets."
    }
  }
}
