{
  "about": {
    "description": "Engenheiro Frontend Sênior com mais de 9 anos de experiência construindo aplicações web escaláveis e de alta performance usando React, Next.js, Vue e TypeScript.\n\nTrabalhei em setores financeiro, automotivo, viagens, e-commerce e educação, especializando-me em arquiteturas modernas (SSR, Microfrontends, BFF), design systems e experiências de usuário complexas.\n\nAtualmente baseado em Lisboa/Portugal."
  },
  "menu": {
    "home": "Início",
    "about": "Sobre",
    "projects": "Projetos",
    "experience": "Experiência",
    "contact": "Contato"
  },
  "at": "em",
  "sections": {
    "experience": "Experiência",
    "projects": "Projetos",
    "techStack": "Tech Stack",
    "connect": "Conecte",
    "contact": "Vamos trabalhar juntos?"
  },
  "experience": {
    "yearsShort": "anos"
  },
  "present": "Presente",
  "projects": {
    "flowsign": {
      "name": "FlowSign",
      "description": "Plataforma de assinatura digital para gestão de documentos eletrônicos e automação de fluxos de trabalho."
    },
    "abconsindcon": {
      "name": "AAbcon Sindcon Website",
      "description": "Site da associação sindical da indústria da construção com serviços para membros e notícias."
    },
    "likeappro": {
      "name": "LikeAppro",
      "description": "Plataforma de aprovação social e engajamento para validação de conteúdo e gestão de workflows."
    },
    "previbayer": {
      "name": "Previ Bayer Brasil",
      "description": "Sistema de gestão de previdência privada para funcionários da Bayer no Brasil."
    },
    "nespresso": {
      "name": "Nespresso Professional",
      "description": "Desenvolvi o módulo de frete com integração de transportadoras no carrinho e módulo de devolução de pedidos no painel do usuário."
    },
    "atvos": {
      "name": "Atvos Corporate Website",
      "description": "Site corporativo de empresa de energia renovável e biocombustíveis."
    },
    "novonor": {
      "name": "Novonor Notícias",
      "description": "Portal de notícias e plataforma de comunicação corporativa do grupo Novonor."
    },
    "vexty": {
      "name": "Vexty Relatórios de Investimento",
      "description": "Plataforma de relatórios de investimento interativos e visualização de dados financeiros."
    }
  },
  "experiences": {
    "mercedesBenz": {
      "role": "Engenheiro Frontend Sênior",
      "company": "Mercedes-Benz.IO",
      "description": "Parte da equipe responsável pela experiência de Busca & Resultados no site da Mercedes-Benz. Desenvolveu e manteve funcionalidades principais usando TypeScript, Vue.js e SSR, melhorando performance e escalabilidade."
    },
    "skrolCapital": {
      "role": "Engenheiro Frontend Sênior",
      "company": "SKROL Capital Inc.",
      "description": "Desenvolveu dois produtos full-stack com IA do zero: Plataforma de Descoberta de Investidores (Laravel, React, Python) e FlowSign Plataforma de Assinatura com IA (Laravel, React, Next.js). Liderou arquitetura e entrega end-to-end."
    },
    "aubay": {
      "role": "Desenvolvedor Frontend Sênior",
      "company": "Aubay Portugal",
      "description": "Contribuiu para novos módulos de sistema interno do Millennium BCP usando React, Redux e Node.js. Construiu componentes para design system empresarial em ambiente Ágil."
    },
    "cvc": {
      "role": "Desenvolvedor Frontend Sênior",
      "company": "CVC CORP",
      "description": "Aprimorou Dashboard de Usuário para milhões de clientes (voos, hotéis, aluguéis). Contribuidor-chave no redesign do Sistema de Login CVC com adoção de microfrontend. Construiu endpoints BFF com Node.js."
    },
    "netshoes": {
      "role": "Desenvolvedor Frontend",
      "company": "Netshoes Group",
      "description": "Criou ferramentas admin de marketing (Cupons, Clusters, Labels). Construiu engine de promoções reduzindo tempo de processamento de 48h para 2h. Implementou lógica de promoção em homepage, carrinho e checkout."
    },
    "rperformance": {
      "role": "Engenheiro de Software",
      "company": "RPerformance Group",
      "description": "Liderou reestruturação de plataforma e-learning para Santander Bank. Refatorou arquitetura separando backend (Laravel) e frontend (React). Melhorou escalabilidade e performance do sistema."
    },
    "jota3w": {
      "role": "Engenheiro de Software",
      "company": "Jota3w Comunicação Digital",
      "description": "Desenvolveu soluções frontend para clientes empresariais. Construiu templates WordPress customizados. Integrou APIs Nespresso e DocuSign. Desenvolveu módulo de frete para Nespresso. Liderou desenvolvimento de intranet para supermercados Assaí."
    }
  }
}
